{
  "case_title": "Nelson v. Larholt",
  "court": "King's Bench Division",
  "date": "19-invalid-1947",
  "year": "1947",
  "suit_number": "",
  "lex_citation": "LEX(1947)-3391",
  "other_citations": [
    "2PLR/1948/1",
    "[1948]3391K.B."
  ],
  "area_of_law": [
    "Tort and Personal Injury",
    "Lex",
    "Befor",
    "Estate Administration",
    "S",
    "Children and Women Law",
    "Banking and Finance"
  ],
  "semantic_tags": [
    "Caselaw",
    "Legal Document",
    "Case"
  ],
  "judge": "Denning J",
  "representation_appellant": [
    "Plaintiffs",
    "Stanley Jarrett & Co",
    "& Simon Burns",
    "Tort",
    "Judgment From",
    "Of Action",
    "Connor",
    "Douglas Lowe",
    "Cause",
    "P. M. O",
    "C. Butcher"
  ],
  "representation_respondent": [
    "Personal Injury",
    "Recipient Put on Inquiry - Restitution - When",
    "Money - Taken From Owner - Without His Authority - Right of Owner to Follow Money - Until",
    "Banking"
  ],
  "originating_court": [
    "Facts and Claims",
    "If a Man's Money Be Taken From the True Owner, Without His Authority, He Can Recover the Amount From Any Person Into Whose Hands It Can Be Traced, Unless and Until It Reaches One Who Receives It in Good Faith and for Value and Without Notice of the Want of Authority. This Principle Was Evolved Side by Side in the Courts of Both Equity and Law.",
    "From Time to Time, During Three Years, Over a Period of Sixteen Months an Executor Fraudulently, as Was Found, Drew Eight Cheques on the Banking Account of His Testator's Estate in Favour of the Defendant, Amounting in All to 135l., Receiving From the Defendant the Money in Cash, Which He Used for His Own Purposes. the Cheques Were Signed in the Form \"G.A.P. Executor of W. B. Deed.\" the Defendant Collected the Cheques Through His Own Banking Account. the Three Beneficiaries of the Estate and a Co-executor Sued the Defendant for 135l. as Being a Trustee Thereof for the Plaintiffs, Alternatively, for Money Had and Received to the Plaintiffs' Use And, in the Further Alternative, as Damages for Conversion. the Defendant Received the Cheques for Value and It Was Not Suggested That He Did Not Receive Them in Good Faith.",
    "Held, That, for the Defendant to Escape Liability, It Was Also Necessary That He Should Have Received the Cheques Without Notice of the Executor's Want of Authority. on the Evidence in This Case the Inference Was Irresistible That the Defendant Knew or Ought to Have Known of the Executor's Want of Authority.",
    "Action.",
    "William Burns, the Testator, by His Will, Dated February 24, 1941, Appointed George Alfred Potts and the Fourth Named Plaintiff, Simon Burns, as Executors and Trustees of His Will and Estate Which He Bequeathed to the Three First Named Plaintiffs. the Testator Died in June, 1942, and on August 8, 1942, the Will Was Proved and Probate Granted to Potts with Power Reserved to Simon Burns, Who Was Then Abroad in Australia.",
    "Potts Opened an Account with the Midland Bank, Kentish Town Road, as \"executor of William Burns Deceased\" Into Which Were Paid Moneys of the Estate. From Time to Time on Dates in the Years 1942, 1943 and 1944, Over a Period of About Sixteen Months, Potts Drew on This Account, Eight Cheques in Favour of the Defendant, David Larholt, a Turf Accountant, Totalling, in All, 135l. These Cheques Were Three for 25l.; One for 20l.; One for 15l.; Two for 10l. and One for 5l. Each of the Cheques Was Signed by Potts as Drawer as Follows: \"g. A. Potts, Executor of Wm. Burns Deed.\" on November 9, 1946, Probate Was Duly Granted to Simon Burns Who Had Returned to This Country and Who, on Discovering These Facts, Together with the Three Beneficiaries Under the Will Sued the Defendant (1.) as Trustee for Them of the 135l.; Alternatively (2.) for the 135l. as Money Had and Received for the Use of the Plaintiffs and in the Further Alternative (3.) as Damages for Conversion of the Cheques. Both Potts and the Defendant Gave Evidence Stating That the Cheques Were Not Given for Bets. They Said That the Cheques Were Cashed by Larholt When Potts Brought Them to Him Out of Office Hours. Potts Said That He Could Not Remember What He Had Done with the Moneys Received From Larholt, Who Handed the Cheques to His Bank for Collection and Received the Proceeds From the Estate.",
    "Douglas Lowe for the Plaintiffs.",
    "The Cheques Were Drawn on the Account of the Testator's Estate and This the Defendant Knew Since Each Cheque Was Signed \"g. A. Potts Executor of Wm. Burns Deed.\" the Defendant Was the Payee of the Cheques and Therefore Knew, or Ought to Have Known, of the Want of Authority. the Defendant Therefore, Was a Trustee of the Money He Received From the Testator's Estate for the Plaintiffs. See the Judgment of Lord Haldane in John V. Dodwell & Co., Ld. (1), Which Shows That There Was a Conversion of the Cheques. \"those Who Know That a Fund Is a Trust Fund Cannot Take Possession of That Fund for Their Own Private Benefit, Except at the Risk of Being Liable to Refund It in the Event of the Trust Being Broken by the Payment,\" Per Fry J. in Foxton V. Manchester and Liverpool District Banking Co. (1) Cited in Attorney-general V. De Winton (2).see Also Reckitt V. Barnett, Pembroke and Slater, Ld. (3). Hambro V. Burnand (4) Is Distinguishable on the Facts, as It Was Distinguished in Reckitt's Case(3). This Money Is Also Recoverable as Money Had and Received to the Use of the Plaintiffs.",
    "P. M. O'connor for the Defendant.",
    "The Plaintiffs Claim That the Defendant Must Repay the Money, Unless He Received the Cheques Bona Fide, for Value, and Without Notice of the Want of Authority. the First Two Conditions Were Satisfied and So Was the Third. There Is No Evidence as to the Time When Potts Decided to Help Himself to the Money. When the Cheques Were Handed to the Defendant, There Was No Want of Authority of Which the Defendant Would Have Notice. the Executor Had Authority to Draw Out the Whole of the Money From the Account and Keep It in a Safe or on His Person, if He Chose to Do So. It Cannot Be Affirmed That When Potts Handed a Cheque to the Defendant He Was Going to Use the Money, Received in Exchange for It, for His Own Purposes. at the Highest, It Can Be Affirmed That the Defendant Did Not Know What Potts Was Going to Do with This Money. in Reckitt V. Barnett (3) Lord Terrington Drew a Cheque on Sir Harold Reckitt's, the Plaintiff's, Account Acting Under the Ostensible Authority of His Principal and Signed: \"sir Harold J. Reckitt, Bart. by Terrington, His Attorney,\" and This Cheque Was Made Payable to the Defendants Who Knew, When They Received It, That the Payment Was Made in Respect of Lord Terrington's Personal Debt to Them.",
    "The Facts Here Were Not Similar and That Case Is Irrelevant. the Breach of Trust by Potts Here Was Not the Drawing of the Cheque, but the Use He Afterwards Made of the Money for His Own Purposes and There Was No Conversion by Potts of the Cheques. the Executor Had Both Ostensible and Actual Authority to Draw Cheques on the Account. if It Is Found That Potts Used the Moneys Handed to Him by the Defendant in Exchange for the Cheques, for His Own Purposes, That the Defendant Could Not Have Known.",
    "(1) (1881) 44 L. T. 406, 408.; (2) [1906] 2 Ch. 106, 116.; (3) [1929] A. C. 176.; (4) [1904] 2 K. B. 10.",
    "All He Knew Was That He Received Cheques From an Account, Drawn by a Person Entitled to Draw on That Account. See Bryant, Powis and Bryant, Ld. V. the Quebec Bank (1). Lord Macnaghten Said in That Case(2): \"the Authority of Davies as the Agent and Attorney of the Company Was Derived From the Power of Attorney. Â€¦ That Instrument in Terms Authorizes the Attorney to Indorse Bills of Exchange. Their Lordships Agree with Andrews J. That the Fact That Davies Abused His Authority and Betrayed His Trust Cannot Affect Bona Fide Holders for Value of Negotiable Instruments Indorsed by Him Apparently in Accordance with His Authority.\"",
    "The Defendant Was Under No Duty to Make Any Inquiry as to the Way in Which Potts Intended to Use the Money Which He Received for the Cheques; But, in Fact, He Did So. It Cannot Be That Every Recipient of a Cheque From an Executor, Drawn on an Executor's Account, Is Bound to Make Inquiry of the Executor What He Proposes to Do with the Money. It Appears That There Is No Reported Case Raising Precisely This Point.",
    "Douglas Lowe Replied.",
    "Main Judgment",
    "Denning J., Having Stated the Facts Continued:",
    "I Am Satisfied That Potts Was Acting Fraudulently: He Did Not Draw the Cheques or Use the Money for the Purposes of the Estate, but for His Own Purposes. the Relevant Legal Principles Have Been Much Developed in the Last Thirty-five Years. a Man's Money Is Property Which Is Protected by Law. It May Exist in Various Forms, Such as Coins, Treasury Notes, Cash at Bank, or Cheques, or Bills of Exchange of Which He Is \"the Holder\"(3) But, Whatever Its Form, It Is Protected According to One Uniform Principle. if It Is Taken From the Rightful Owner, Or, Indeed, From the Beneficial Owner, Without His Authority, He Can Recover the Amount From Any Person Into Whose Hands It Can Be Traced, Unless and Until It Reaches One Who Receives It in Good Faith and for Value and Without Notice of the Want of Authority. Even if the One Who Received It Acted in Good Faith, Nevertheless if He Had Notice - That Is, if He Knew of the Want of Authority or Is to Be Taken to Have Known of It - He Must Repay. All the Cases That Occur in the Books, of Trustees or Agents Who Draw Cheques on the Trust Account or the Principal's Account for Their Own Private Purposes, or of Directors Who Apply Their Company's Cheques for Their Own Account, Fall Within This One Principle.",
    "(1) [1893] A. C. 170, 179.; (2) Ibid. 180.; (3) by S. 2 of the Bills of Exchange Act, 1882:- \"in This Act, Unless the Context Otherwise Requires ... 'holder' Means the Payee or Indorsee of a Bill or Note Who Is in Possession of It, or the Bearer Thereof\" and by the Same Section, \"'bearer' Means the Person in Possession of a Bill or Note Which Is Payable to Bearer.\"",
    "The Rightful Owner Can Recover the Amount From Anyone Who Takes the Money with Notice, Subject, of Course, to the Limitation That He Cannot Recover Twice Over. This Principle Has Been Evolved by the Courts of Law and Equity Side by Side. in Equity It Took the Form of an Action to Follow Moneys Impressed with an Express Trust, or with a Constructive Trust Owing to a Fiduciary Relationship. in Law It Took the Form of an Action for Money Had and Received or Damages for Conversion of a Cheque. It Is No Longer Appropriate, However, to Draw a Distinction Between Law and Equity. Principles Have Now to Be Stated in the Light of Their Combined Effect. Nor Is It Necessary to Canvass the Niceties of the Old Forms of Action. Remedies Now Depend on the Substance of the Right, Not on Whether They Can Be Fitted Into a Particular Framework. the Right Here Is Not Peculiar to Equity or Contract or Tort, but Falls Naturally Within the Important Category of Cases Where the Court Orders Restitution, if the Justice of the Case So Requires.",
    "Applying the Principle in This Case, It Is Plain That the Moneys of the Estate Were Transferred by Potts Without Any Authority Into the Hands of the Defendant. Potts Had Clearly No Authority to Draw Cheques on the Bank Account for His Own Purposes. the Law Will Therefore Compel the Defendant to Restore the Moneys to the Estate Unless He Received the Moneys in Good Faith and for Value and Without Notice of the Want of Authority. It Is Plain That He Received Them for Value and MR. Lowe Did Not Suggest That He Did Not Receive Them in Good Faith. but Did He Have Notice of the Want of Authority? That Depends on What Amounts to Notice. He Was the Original Payee of the Cheque, And, as Such, Was Not Protected by the Fact That It Was a Negotiable Instrument. He Must, I Think, Be Taken to Have Known What a Reasonable Man Would Have Known. If, Therefore, He Knew or Is to Be Taken to Have Known of the Want of Authority, As, for Instance, if the Circumstances Were Such as to Put a Reasonable Man on Inquiry, and He Made None, or if He Was Put Off by an Answer That Would Not Have Satisfied a Reasonable Man, Or, in Other Words, if He Was Negligent in Not Perceiving the Want of Authority, Then He Is Taken to Have Notice of It. That Is, I Think, the Result of Reckitt V. Barnett (1).",
    "[1929] A. C. 176",
    "If the Defendant Had Negotiated the Cheque to a Third Person, the Test of Notice to That New Holder Would Have Been Different. This Holder Would Have Been Able to Claim That He Was a Holder in Due Course. Notice to Such a Holder Would Depend on His Own State of Mind, Not on That of a Reasonable Man. if He, in His Own Mind, Realized That There Was Something Wrong with the Cheque and Shut His Eyes to It, He Would Be Taken to Have Notice, but Not Otherwise. Whilst on This Question of Notice, I Would Add That No One Can Gain a Title to Money Through a Forged Indorsement. the Holder Is Treated as if He Had Notice of the Forgery. There Are Exceptions, of Course, Stated in the Act. but None of Those Matters Arise Here. This Is a Case Where the Plaintiff's Money in the Form of Cash at Bank Was Transferred by a Wrongdoer to the Defendant and He Must Be Taken to Have Known What Any Reasonable Man Would Have Known. in This Case I Am Quite Satisfied That the Defendant Had Notice of the Want of Authority. Each of the Cheques on Its Face Showed That It Was Drawn on the Executor's Account. Potts Brought It to Him Out of Office Hours with a Request to Cash It. Why Did Not Potts, if He Wanted Cash, Get It From the Bank? It Seems to Me That Any Reasonable Person Would Have Been Put on Inquiry. the Defendant Admitted as Much, for He Said That He Asked Potts About It and That Potts Said That It Was in Connexion with the Trust That He Wanted the Money. on One Occasion Potts Said That He Was Going to Scotland on Estate Business. No Reasonable Man Would Have Been Satisfied with Those Answers. if Potts, as Executor, Wanted Money Legitimately for Estate Purposes, He Could Have Got It From the Bank That Day or Waited Till the Next Morning. All That Applies to the First Cheque Which the Defendant Cashed. Then, When It Came to Cashing Cheque After Cheque, Seven More, and the Last One a Piece of Paper with a 2d. Stamp on It, the Inference Is Irresistible That the Defendant Knew or Ought to Have Known That Potts Had No Authority to Do What He Was Doing. Any Reasonable Man in the Defendant's Position Would Have Known It. I Hold, Therefore, That in This Case the Plaintiffs Are Entitled to Recover the Money From the Defendant and I Award Judgment for the Amount of 135l.",
    "\u0007",
    "\u0007judgment for Plaintiffs.",
    "\u0007",
    "\u0007",
    "\u0007",
    "\u0007",
    "\u0007solicitors for the Plaintiffs: C. Butcher & Simon Burns.",
    "Solicitors for the Defendant: Stanley Jarrett & Co.",
    "C. G. M.",
    "[1948] 1 K.B. 339"
  ],
  "doc_id": "e119926b-ead0-47f3-aa09-b40462b750eb",
  "doctype": "Case",
  "parties": [
    "Nelson and Others",
    "Larholt"
  ]
}