{
    "case_title": "Abdulrahman Abubakar & anor v. Senator Aidoko Ali Usman & ors",
    "area_of_law": "Constitutional Law and Electoral Law",
    "subject_matter": [
        "Election Petition",
        "Jurisdiction",
        "Finality of Court of Appeal Decisions",
        "National Assembly Election Disputes"
    ],
    "summary": "This case centers on an appeal against the Court of Appeal's ruling delivered on February 11, 2016. The appellants had filed a motion requesting the Court of Appeal to correct alleged errors in its judgment of December 2, 2015, regarding a National Assembly election petition. The original dispute arose from the March 28, 2015 National Assembly Election for Kogi East Senatorial District, where INEC declared the appellants winners. The respondents challenged this at the Election Petition Tribunal, arguing the first appellant wasn't qualified to contest. The Tribunal nullified the first appellant's election and declared the first respondent the winner. On appeal, the Court of Appeal upheld the nullification but set aside the declaration of the first respondent as winner, instead ordering fresh elections. When the appellants tried to get the Court of Appeal to revise its judgment, it declined jurisdiction, citing Section 246(3) of the Constitution. The Supreme Court ultimately held that it lacked jurisdiction to entertain appeals from Court of Appeal decisions on National Assembly election petitions.",
    "outcome": "The Supreme Court struck out the appeal for lack of jurisdiction and ordered costs of N1,000,000 to be paid personally by the senior counsel for the appellants to the first and second respondents.",
    "ratios": [
        "The Court of Appeal shall be the final court in respect of appeals arising from the National and State Houses of Assembly Election Petitions by virtue of Section 246(3) of the Constitution of Nigeria 1999 (as amended)",
        "Where an appeal is actually in respect of National Assembly election, whether error of a procedural nature or of a procedural vice as to jurisdiction or competence, cannot be corrected by the Supreme Court",
        "The Supreme Court cannot entertain appeals which it has no jurisdiction to adjudicate upon, as absence of jurisdiction is irreparable in law"
    ],
    "precedents": [
        {
            "name": "Opara and Anor v Amadi [2013] 6-7 SC (pt 2) 49",
            "tag": "Cited",
            "document_type": "Case",
            "context": "Only a handful of these decisions would be cited in this judgment. Opara and Anor v Amadi [2013] 6- 7 SC (pt 2) 49; Madumere v Okwara [20l3] 6-7 SC (pt 2) 95; Okadigbo v Emeka and Ors (2012) LPELR -7839 (SC) 17; Emordi v Igbeke (2011) 4 SC (pt 11) 107, 145"
        },
        {
            "name": "Onuaguluchi v Ndu [2001] 7 NWLR (pt 712) 309",
            "tag": "Applied",
            "document_type": "Case",
            "context": "Where an appeal is actively in respect of National Assembly election or other relevant election, whatever efforts of a procedural nature or of a procedural vice as to jurisdiction or competency, cannot be corrected by this Court. They can only be corrected by the Court of Appeal or else they will remain uncorrected or unresolved as this Court cannot intervene since it has no appellate or supervisory jurisdiction over the Court or Appeal in such circumstance. This Court will not permit or encourage any subterfuge under which it may assume jurisdiction to hear an appeal in respect of which the Constitution has in clear and unambiguous language made the Court of Appeal the final Court."
        },
        {
            "name": "Awuse v Odili [2003] 18 NWLR (pt 851) 116",
            "tag": "Followed",
            "document_type": "Case",
            "context": "It is therefore now well settled that pursuant to the provisions of Section 246 (1) (b) (i) and (3) of the 1999 Constitution, the Court of Appeal acting within its jurisdiction in deciding an appeal rising from an election petition as stipulated under the said Section of the Constitution is the final Court of Appeal. Whether it did so rightly or wrongly in its decision cannot be questioned on appeal in this Court by virtue of the express provisions of the said Section 246(3) of the 1999 Constitution which stipulates that the decision of the Court of Appeal in respect of appeals arising from the relevant election shall be final."
        },
        {
            "name": "Dangana v Usman (2012) LPELR-7827 (SC)",
            "tag": "Applied",
            "document_type": "Case",
            "context": "In short, by virtue of Section 246 (1) (b) and (3) of the 1999 Constitution, the Court of Appeal has the mandate to decide an appeal arising from an election petition and shall be the final Court. Whether it did so perfectly, rightly or wrongly, the decision it arrives at cannot be taken on appeal to the Supreme Court for consideration."
        },
        {
            "name": "Madumere and Anor v Okwara and Anor (2013) LPELR-20752 (SC)",
            "tag": "Followed",
            "document_type": "Case",
            "context": "The provisions of Section 246 (3) of the 1999 Constitution, as amended is (sic) very clear and unambiguous. It (sic) enacts as follows: '3. The decisions of the Court of Appeal in respect of appeal arising from the National and State Houses of Assembly Election petitions shall be final'. By numerous decisions of the Supreme Court, the above provision and similar ones to the like effect have been interpreted to mean that no further appeal can be filed against the decision of the Court of Appeal in appeals on National and State Houses of Assembly Election Petitions."
        },
        {
            "name": "Okadigbo v Emeka and Ors (2012) LPELR-7839 (SC)",
            "tag": "Followed",
            "document_type": "Case",
            "context": "The lower Court is the final Court in the appeals arising from the National and State Houses of Assembly Election Petition Tribunal. Therefore, this Court lacks the jurisdiction to entertain such appeals vis-a-vis election petitions from the lower Court. It is the final Court in such matters whether rightly or wrongly decided."
        }
    ],
    "counsel_precedents": [
        {
            "name": "Mark v Eke (2004) All FWLR (pt. 200) 1455",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Ukiri v UBA (2016) 3 NWLR (Pt.1500) 440",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Madumere & Anor v Okwara & Anor (2013) LPELR-20752",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Esewe v Gbe [1988] 5 NWLR (pt. 93) 134",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Dingyadi v INEC (No.1) [2010] 18 NWLR (Pt. 1224) 1",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Ugwa v Lekwauwa [2010] 19 NWLR (pt. 1226) 26",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Sha'aban v Sambo [2010] 19 NWLR (pt. 1226) 353",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Suleiman v C.O.P. Plateau State [2008] 21 WRN 1",
            "cited_by": "Court's Reference"
        },
        {
            "name": "Udosen v State [2007] 4 NWLR (pt 1023) 125",
            "cited_by": "Court's Reference"
        },
        {
            "name": "Ezeugo v Ohanyere [1978] 6-7 SC 171",
            "cited_by": "Court's Reference"
        },
        {
            "name": "Oniah v Onyia [1989] 1 NWLR (pt 99) 514",
            "cited_by": "Court's Reference"
        },
        {
            "name": "Omole and Sons Ltd v Adeyemo [1994] 4 NWLR (pt 336) 48",
            "cited_by": "Court's Reference"
        },
        {
            "name": "Njoku v Dikibo (1998) 1 NWLR (PT. 534) 496",
            "cited_by": "Court's Reference"
        },
        {
            "name": "Igbesusi v Fabolude (1983) 2 S.C. 75",
            "cited_by": "Court's Reference"
        },
        {
            "name": "Cardoso & Ors v Mrs. Williams (1982) 7 S.C.17",
            "cited_by": "Court's Reference"
        },
        {
            "name": "Samuel Idowu Banire & Ors v Folake Balogun (1986) 4 NWLR (Pt. 38) 746",
            "cited_by": "Court's Reference"
        },
        {
            "name": "Ishola v Ajiboye (1998) 1 NWLR (Pt. 532) 71",
            "cited_by": "Court's Reference"
        }
    ]
}