{
    "case_title": "Adamu vs the state",
    "area_of_law": [
        "Criminal Law"
    ],
    "subject_matter": [
        "Culpable Homicide",
        "Criminal Conspiracy"
    ],
    "summary": "The case involves an appeal from a Court of Appeal decision that affirmed the conviction of Adamu (appellant) for culpable homicide not punishable with death. The appellant was originally charged alongside three others, including Ahmed M. Dikko who absconded during trial. The trial court stayed proceedings against Dikko but continued with the remaining accused persons. The appellant was convicted and sentenced to 15 years imprisonment by the High Court of Niger State for causing the death of Manu Hassan. The appellant appealed to the Court of Appeal, which affirmed the conviction, leading to this further appeal to the Supreme Court. The appellant's main grounds of appeal included concerns about the joint trial process after Dikko's absence, the validity of the trial court's judgment format, and challenges to his confessional statement's admissibility. The Supreme Court dismissed the appeal, finding no merit in the appellant's arguments and affirming both the conviction and sentence.",
    "outcome": "The Supreme Court dismissed the appeal and affirmed the Court of Appeal's judgment which had confirmed the appellant's conviction and 15-year sentence for culpable homicide not punishable with death.",
    "ratios": [
        "A confessional statement that was free and voluntary regardless of the facts that the appellant subsequently resiled from his voluntary confession at trial, is good evidence to ground conviction",
        "A confessional statement does not become inadmissible simple because the accused person denied having made it",
        "The confessional statement of an accused, where it is direct, positive and unequivocal as to the commission of the crime charged, is the best evidence and can be relied upon solely for conviction of the accused person",
        "The Supreme Court will not interfere with concurrent findings of facts made by the trial court and the Court of Appeal unless such findings are perverse; or are not supported by the evidence; or are reached as a result of a wrong approach to the evidence"
    ],
    "precedents": [
        {
            "name": "Ariori & Ors. v. Muriamo Elemo & Ors. (1983) 1 SC 13",
            "tag": "Cited",
            "document_type": "Case",
            "context": "In the famous case of Ariori & Ors. v. Muriamo Elemo & Ors. (1983) 1 SC 13 at 24, (1983) 1 SCNLR 1, (1983) 14 NSCC 1 per Obaseki JSC, this court opined that fair hearing means a trial conducted according to all the legal rules formulated to ensure that justice is done to the parties to the cause."
        },
        {
            "name": "Cameroon Airlines v. Otutuizu (2011) All FWLR (Pt. 570) 1260",
            "tag": "Applied",
            "document_type": "Case",
            "context": "See Ochiba v. State (2011) 17 NWLR (Pt. 1277) 663, (2011) 12 SC (Pt. IV) page 79, (2012) All FWLR (Pt. 608) 849 per RhodesVivour JSC (pages 51-52, paragraphs F-B). See also Cameroon Airlines v. Otutuizu (2011) All FWLR (Pt. 570) 1260, (2011) 1- 2 SC (Pt. III) page 200, (2011) 4 NWLR (Pt. 1238) 512"
        },
        {
            "name": "Patrick Ikemson & Ors v. The State (1989) 3 NWLR (Pt.110) 455",
            "tag": "Followed",
            "document_type": "Case",
            "context": "See for example Partick Ikemson Ors v. The State (1989) 3 NWLR (Pt.110) 455 at 476 paragraph D, (1989) 20 NSCC (Pt. 11) 471; Joseph Idowu v. The State (2000) FWLR (Pt. 16) 2672, (2000) 12 NWLR (Pt. 680) 48, (2000) 7 SC 50 at 62; Nkwuda Edamine v. The State (1996) 3 NWLR (Pt. 438) 530 at 537, paragraphs D-E; Samuel Theophilus v. The State (1996) 1 NWLR (Pt. 423) page 139 at 155, paragraphs A-B and Awopeju v. The State (2002) 3 MJSC 141 at 151."
        },
        {
            "name": "Peter Iliya Azabada v. The State (2014) All FWLR (Pt.751) 1620",
            "tag": "Followed",
            "document_type": "Case",
            "context": "This court, and incidentally by no less a jurist other than the learned Onnoghen JSC (as he then was; and proudly now the CJN) in Peter Iliya Azabada v. The State (2014) All FWLR (Pt.751) 1620, paragraph B has made it abundantly clear in the following words:- 'The confessional statement of an accused, where it is direct, positive and unequivocal as to the commission of the crime charged, is the best evidence and can be relied upon solely for conviction of the accused person. An accused person can be convicted on his confessional statement alone, where the confession is constant with other ascertained facts which have been proved.'"
        },
        {
            "name": "Attorney-General, Federation v. Abubakar (2007) All FWLR (Pt. 389) 1264",
            "tag": "Followed",
            "document_type": "Case",
            "context": "This court, also in the case Attorney-General, Federation v. Abubakar (2007) All FWLR (Pt. 389) 1264, (2007) 10 NWLR (Pt. 1041) 1, (2007) 20 WRN, per Akintan JSC restated the position as follows: 'It is necessary to say something about the general principle of interpretation of statutes, including Constitutions. The generally accepted rule of construction is that, it is to be assumed that the words and phrases of technical legislation are used in their technical meaning if they have acquired one, and otherwise in their ordinary meaning.'"
        }
    ],
    "counsel_precedents": [
        {
            "name": "Chief of Air Staff v. Iyen (2005) All FWLR (Pt. 252) 404",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Ochu v. F.R.N. (2011) All FWLR (Pt. 563) 2008",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Alintah v. Federal Republic of Nigeria (2008) All FWLR (Pt. 436) 1999",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Adeoye v. State (1999) 4 SCNJ (Pt. 136) 142",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Eyorokoromo v. The State (1979) 6-9 SC 3",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "State v. Lawal (2013) All FWLR (Pt. 679) 1024",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Haruna v. University of Agriculture, Makurdi (2006) All FWLR (Pt. 304) 432",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Sunday v. State (2011) All FWLR (Pt. 568) 922",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Awoniyi v. Aleshinloye (1998) 9 NWLR (Pt. 564) 71",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Opayemi v. State (1985) 2 NSCC 921",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Okonji v. Njokanma (1991) 7 NWLR (Pt. 202) 131",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Uka v. Irolo (1996) 4 NWLR (Pt. 441) 218",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "GE Int'l Operations Ltd v. Q-Oil and Gas Services (2014) All FWLR (Pt. 761) 1509",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Doma v. Ogiri (1998) 3 NWLR (Pt. 541) 246",
            "cited_by": "Counsel to Respondent"
        }
    ]
}