{
    "case_title": "Adegbola v. Idowu",
    "area_of_law": [
        "Civil Procedure",
        "Practice and Procedure"
    ],
    "subject_matter": [
        "Extension of Time",
        "Jurisdictional Challenge",
        "Court Rules",
        "Appellate Procedure"
    ],
    "summary": "This case concerns an application before the Supreme Court seeking multiple reliefs including extension of time to file appellant's brief and leave to raise a new jurisdictional issue. The appellants' counsel cited eye problems as the reason for delay in filing the brief. The main contention arose regarding whether sufficient reasons were provided for the delay and whether a new jurisdictional challenge about the existence of 'Eruwa Judicial Division' could be raised for the first time at the Supreme Court. The court considered whether counsel's medical condition constituted an exceptional circumstance warranting time extension, and whether the jurisdictional question was substantial enough to be permitted as a new issue. The court ultimately granted all the reliefs sought, allowing both the time extension and the new jurisdictional challenge.",
    "outcome": "The Supreme Court granted the application in its entirety, allowing extension of time to file appellant's brief and granting leave to raise the new jurisdictional issue regarding 'Eruwa Judicial Division'.",
    "ratios": [
        "Where any notice or any other process is required to have an address for service endorsed on, it shall not be deemed to have been properly filed unless such address has been endorsed on it.",
        "When no credible excuse is given no indulgence can be granted. Affidavit evidence must show something which entitles the applicants to the courts discretion e.g. mistake, inadvertence or error of judgment of counsel.",
        "Counsel's carelessness cannot be visited on the litigant where such carelessness is pardonable.",
        "The issue of jurisdiction, being the soul of litigation can be raised at any time even in this court for the first time.",
        "Rules of court must, prima facie, be obeyed. It therefore follows, that in order to justify the exercise of the court's discretion in extending the time, there must be some material upon which to base the exercise of that discretion."
    ],
    "precedents": [
        {
            "name": "Williams v. Hope Rising voluntary Funds Society (1982) 2 SC 145",
            "tag": "Applied",
            "document_type": "Case",
            "context": "When a court is called upon to make an order of extension of time within which to do certain things, prescribed by the rules of court for taking certain procedural steps, the court ought always to bear in mind that the rules of court must, prima facie, be obeyed. It therefore follows, that in order to justify the exercise of the court's discretion in extending the time, there must be some material upon which to base the exercise of that discretion. See Williams v. Hope Rising voluntary Funds Society (1982) 2 SC 145; Elobisi v. Onyeonwu (1989) 5 NWLR (Pt. 120) 224; Doherty v. Doherty (1964) 1 All NLR 299; Ogar v. James (2001) FWLR (Pt. 67) 930, (2001) NWLR (Pt. 722) 621 and Sanusi v. Ayoola (1992) 9 NWLR (Pt. 265) 275."
        },
        {
            "name": "Omoregie v. Emovon (1997) 6 SC 6",
            "tag": "Applied",
            "document_type": "Case",
            "context": "In an application to appeal, this court has held that it may not amount to sufficient reason merely to say that the counsel was ill or that there was dereliction of duty on the part of his junior or that the volume of chamber work made the counsel forget to file the appeal. See Omoregie v. Emovon (1997) 6 SC 6; Benson v. Nigerian Agip Oil Co. Ltd (1952) 5 SC 1."
        },
        {
            "name": "Doherty v. Doherty (1464) 1 All NLR 299",
            "tag": "Applied",
            "document_type": "Case",
            "context": "In this respect counsel's carelessness cannot be visited on the litigant where such carelessness is pardonable. See Doherty v. Doherty (1464) 1 All NLR 299; Bowaje v. Adediwura (1476) 6 SC 143."
        },
        {
            "name": "Bronik Motors v. Wema Bank Nig Ltd (1983) 1 SCNLR 296",
            "tag": "Applied",
            "document_type": "Case",
            "context": "The law is settle that issue of jurisdiction, being the soul of litigation can be raised at any time even in this court for the first time. See Bronik Motors v. Wema Bank Nig Ltd (1983) 1 SCNLR 296; Oredoyin v. Arowolo (1989) 4 NWLR (Pt. 114) 172; Gen.. Electric Motors v. Akande (1999) 1 NWLR (Pt. 588) 532."
        },
        {
            "name": "Nwora v. Nwabueze (2011) All FWLR (Pt. 589) 1002",
            "tag": "Applied",
            "document_type": "Case",
            "context": "In further emphasis, the grounds predicating the application as well as the affidavit deposing to the facts thereon must be convincing, as to warrant the exercise of discretion in favour thereof. See also Nwora v. Nwabueze (2011) All FWLR (Pt. 589) 1002, (2011)15 NWLR (Pt. 1271) page 467."
        },
        {
            "name": "Ratnam v. Cumarasamy (1964) 3 All E.R. 933",
            "tag": "Applied",
            "document_type": "Case",
            "context": "It is trite that Rules of court are not made for fun. They are made to be complied with. Where the purpose of the Rules is to provide time-table for conduct of litigation, there must be strict compliance with the Rules; because to do otherwise will defeat the purpose of the Rules. See Ratnam v. Cumarasamy (1964) 3 All E.R. 933 at 935."
        },
        {
            "name": "Shanu v. Afribank Nigeria Plc. (2000) FWLR (Pt. 23) 1221",
            "tag": "Applied",
            "document_type": "Case",
            "context": "At any rate, this court in multiplicity of decided authorities held that negligence or carelessness of counsel can still serve as acceptable explanation for delay to apply for extension of time to appeal. See the cases of Shanu v. Afribank Nigeria Plc. (2000) FWLR (Pt. 23) 1221, (2000)18 WRN 1 or (2000)13 NWLR (Pt. 684)392 at 403"
        }
    ],
    "counsel_precedents": [
        {
            "name": "Isiaka v. Ogundimu (2006) 13 NWLR (Pt. 997) 401",
            "cited_by": "Counsel to Appellant",
            "context": "In arguing this application, Mr. Ogunwole, learned senior counsel for the appellants/applicants relied on all the paragraphs of the affidavit, particularly paragraph 3 thereof and submitted that a court of law would normally exercise its discretion in favour of an applicant where his being out of time is due to pardonable inadvertence and/or negligence caused by his counsel. In aid, learned senior counsel cited Isiaka v. Ogundimu (2006) 13 NWLR (Pt. 997) 401 at 414 paragraphs F- G."
        },
        {
            "name": "A.I.C. Limited v. Nigerian National Petroleum Corporation (2005) All FWLR (Pt. 270) 1945",
            "cited_by": "Counsel to Appellant",
            "context": "On whether the appellant can raise fresh issue or fresh point of law under Order 6, rule 5(b) of the Supreme Court Rules, learned senior counsel submitted that the fresh issue that is sought to be raised in this application touches on the jurisdiction of the court. According to the learned senior counsel, the fresh issue is substantial and no fresh evidence will be called to establish it. In aid, learned senior counsel cited A.I.C. Limited v. Nigerian National Petroleum Corporation (2005) All FWLR (Pt. 270) 1945, (2005) 5 SC 11) 60 at page 68."
        },
        {
            "name": "Udo v. R. T. B. C. S (2013) All FWLR (Pt. 692) 1771",
            "cited_by": "Counsel to Respondent",
            "context": "On the appellants' prayer to raise fresh issue or fresh point of law before this court, learned counsel submitted that the appellants/applicants have not satisfied the conditions for doing so. In aid, learned counsel cited the decision of this court in Udo v. R. T. B. C. S (2013) All FWLR (Pt. 692) 1771, (2013) LPELR 19910 (SC)."
        },
        {
            "name": "Ezeigbo v. F. A. T. B. Ltd (1992) 1 NWLR (Pt. 216) 197",
            "cited_by": "Counsel to Respondent",
            "context": "The obligation of the litigant and/or his counsel to comply with the Rules of court has been re-stated by this court in a number of cases including Ezeigbo v. F. A. T. B. Ltd (1992) 1 NWLR (Pt. 216) 197; Iroegbu v. Okwordu (1990) 6 NWLR (Pt. 159) 648; C.C.B. (Nig.) Plc. v. Attorney-General, Anambra State (1992) 8 NWLR (Pt. 261) 526"
        }
    ]
}