{
    "case_title": "Adekoya v. The state",
    "area_of_law": [
        "Criminal Law"
    ],
    "subject_matter": [
        "Armed Robbery",
        "Conspiracy to Commit Armed Robbery"
    ],
    "summary": "The case involves an appeal against the judgment of the Court of Appeal, Ibadan Division, which upheld the conviction of the appellant for armed robbery and conspiracy. On February 11, 2005, two armed robbers attacked Mrs. Cecilia Olufunke Onanuga (PW4) and her daughters at their residence in Ijebu-Ode. During the robbery, N39,000, mobile phones, and a camera were stolen. The appellant was identified and arrested three days later at Oke-Aje market by one of the victims. The prosecution called six witnesses, while the appellant testified in his defense, claiming he was only present at the scene to accompany a friend collecting a debt. The trial court convicted the appellant on both counts and sentenced him to death by hanging. The Court of Appeal affirmed this decision, leading to the appeal to the Supreme Court. The Supreme Court found that the prosecution had successfully proven all elements of armed robbery beyond reasonable doubt, particularly through the strong identification evidence provided by PW1 and PW4.",
    "outcome": "The Supreme Court dismissed the appeal and affirmed the Court of Appeal's decision, upholding the conviction and death sentence by hanging for the appellant.",
    "ratios": [
        "The mere fact that a witness is a blood relation of the victim does not translate, without more to being a tainted witness.",
        "Conspiracy can be inferred from the acts of doing things towards a common end where there is no direct evidence in support of an agreement between the accused persons.",
        "Proof beyond reasonable doubt does not mean proof beyond all doubt, or all shadow of doubt. It simply means establishing the guilt of the accused person with compelling and conclusive evidence.",
        "The courts will not interfere with concurrent findings of the trial court and the Court of Appeal on issues of fact except where the findings are perverse, or there is established a miscarriage of justice or a violation of principles of law or procedure."
    ],
    "precedents": [
        {
            "name": "Fatai Olayinka v. State (2007) All FWLR (Pt. 373) 163",
            "tag": "Cited",
            "document_type": "Case",
            "context": "It is to be reiterated that in criminal matters such as the one we are faced with, the standard of proof is beyond reasonable doubt. This is a principle that is fundamental and sacrosanct and in establishing that required standard of proof all the essential elements or ingredients must be proved on that standard."
        },
        {
            "name": "Alabi v. State (1993) 7 NWLR (Pt. 307) 511",
            "tag": "Cited",
            "document_type": "Case",
            "context": "Getting specifically into the offence of armed robbery on which the appellant was charged, the essential elements thereof are: a. That there was a robbery or series of robberies; b. That the robbery was with arms; and, c. That the accused person was the armed robber or one of the armed robbers."
        },
        {
            "name": "Sherras v. de Rutzen (1895) I.Q.B. 918",
            "tag": "Applied",
            "document_type": "Case",
            "context": "This is so in that while the presumption of mens rea or evil intention or knowledge of the wrongfulness of an act, is an essential ingredient in every offence, the presumption is subject to be displaced either by the words of the statute creating the offence, or by the subject matter with which it deals, and both must be considered."
        },
        {
            "name": "Musa v. State (2012) 3 NWLR (Pt. 1286) 99",
            "tag": "Applied",
            "document_type": "Case",
            "context": "The mere fact that a witness is a blood relation of the victim does not translate, without more to being a tainted witness."
        },
        {
            "name": "Gbadamosi v. State (1991) 6 NWLR (Pt. 196) 182",
            "tag": "Applied",
            "document_type": "Case",
            "context": "On the matter of exhibit D i.e. the cutlass or matchete used by the appellant on PW1, the appellant sought to have the exhibit discountenanced as there was no forensic analysis on the weapon and that its utilization by the trial court has occasioned a miscarriage of justice. That posture cannot fly in the light of other connecting pieces of evidence which made that exhibit authentic, cogent and reliable."
        },
        {
            "name": "Onyenye v. State (2012) All FWLR (Pt. 643) 1810",
            "tag": "Applied",
            "document_type": "Case",
            "context": "In effect, conspiracy can be inferred from the acts of doing things towards a common end where there is no direct evidence in support of an agreement between the accused persons. The conspirators need not know themselves and need not have agreed to commit the offence at the same time. The courts tackle the offence of conspiracy as a matter of inference to be deduced from certain criminal acts or inactions of the parties concerned."
        },
        {
            "name": "Nwaturuocha v. State (2011) 2-3 SC (Pt. 1) 111524",
            "tag": "Applied",
            "document_type": "Case",
            "context": "I shall again state it that poof beyond reasonable doubt as evolved by lord Sankey, L. C. In Woolmington v. DPP (1935) AC 485 is not proof to the hilt as stated by Denning, J. as he then was, in Miller v. Minister of Pensions (1947) 3 All ER 373. It is not proof beyond all iota of doubt as stated by Uwais CJN in Nasiru v. The State (1999) 2 NWLR (Pt. 589) 87 at 98."
        },
        {
            "name": "Abokokuyaro v. State (2012) 2 NWLR (Pt. 1285) 462",
            "tag": "Applied",
            "document_type": "Case",
            "context": "An appellate court will not interfere with the findings of the trial court unless the findings are perverse, not supported by evidence and has led to a miscarriage of justice or any principle of law or procedure has not been followed or complied with"
        },
        {
            "name": "Ndidi v. State (2007) All FWLR (Pt. 381) 1617",
            "tag": "Applied",
            "document_type": "Case",
            "context": "In the case of Ndidi v. The State (2007) All FWLR (Pt. 381) 165, (2007) 13 NWLR (Pt. 1052) 633 at 651, the courts are instructed on what to take into account for purpose of identification of a criminal."
        }
    ],
    "counsel_precedents": [
        {
            "name": "Babalola v. The State (1989) 4 NWLR (Pt. 115) 264",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Daniels v. State (1991) 8 NWLR (Pt. 212) 715",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "State v. Ogbubunjo (2001) FWLR (Pt. 37) 1097",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Nwosu v. State (1998) 8 NWLR (Pt. 562) 433",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Abu Ankwa v. The State (1969) All NLR 129",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Okonji v. The State (1987) NSCC 291",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Oforlete v. State (2000) FWLR (Pt. 12) 2081",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Igwego v. Ezengo (1992) 6 NWLR (Pt. 249) 561",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Enang v. Adu (1981) 11-12 SC 25",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Adefarasin v. Dayekh (2007) All FWLR (Pt. 348) 911",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Oduneye v. The State (2001) FWLR (Pt. 38) 1203",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Obiakor v. The State (2002) FWLR (Pt. 113) 299",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Daboh v. The State (1977) 5 SC 197",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Ubierho v. The State (2005) All FWLR (Pt. 254) 804",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Muonwem v. Queen (1963) 2 SCNLR 172",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "The State v. Salisu & Anor. (1974) 4 NMLR 400",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Anyanwu v. The State (1986) 5 NWLR (Pt. 43) 612",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Igbi v. The State (2000) FWLR (Pt. 3) 358",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Mathew Orimoloye v. The State (1984) 10 SC 138",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Okori v. The State (1989) 1 NWLR (Pt.100)",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Ikemson v. The State (1989) 3 NWLR (Pt. 110)",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Ibrahim v. The State (1991) 4 NWLR (Pt. 186) 399",
            "cited_by": "Referenced in Judgment"
        }
    ]
}