{
    "case_title": "Agbamu v. Ofili",
    "area_of_law": [
        "Property Law",
        "Landlord and Tenant Law"
    ],
    "subject_matter": [
        "Recovery of Possession",
        "Rent Control",
        "Mesne Profits",
        "Appellate Procedure"
    ],
    "summary": "The case involved a landlord-tenant dispute where the respondent (landlord) sought possession of a three-bedroom flat and premises, along with arrears of rent and mesne profits. The appellant (tenant) filed a cross-action challenging the rent increase notice and seeking declarations regarding his tenancy rights. The Ika South Area Customary Court ruled in favor of the landlord but fixed rent at N1,300 per month. Both parties appealed to the High Court, with the tenant challenging various aspects of the judgment and the landlord specifically appealing the mesne profits award. The High Court dismissed the tenant's appeal but increased the mesne profits to N1,600. The tenant further appealed to the Court of Appeal, which ultimately dismissed the appeal but restored the original mesne profits award of N1,300, finding that the High Court had improperly interfered with the trial court's discretion.",
    "outcome": "The Court of Appeal dismissed the appeal but modified the High Court's judgment by restoring the trial Customary Court's award of N1,300 per month as mesne profits, instead of the N1,600 awarded by the High Court.",
    "ratios": [
        "What makes a ground incompetent is not whether it is framed as an error and a mis-direction but whether by so stating it, the other side is left in doubt and without adequate information as to what the complaint of the appellant actually is",
        "Mesne profit is only another term for damages for trespass arising from the particular relationship of landlord and tenant",
        "Where there was an error or omission committed by a court that did not form the basis of the decision arrived at by that court, the judgment appealed against will not be reversed on that ground alone",
        "An appellate court will not, in principle, interfere with the discretion by the trial court unless that discretion is shown to have been exercised upon wrong principles or that the exercise was tinted by some illegality or substantial irregularity"
    ],
    "precedents": [
        {
            "name": "Aderounmu v. Olowu (2000) 4 NWLR (Pt. 652) 253",
            "tag": "Applied",
            "document_type": "Case",
            "context": "In Aderounmu vs. Olowu (supra), the Court of Appeal relying on Nwadike vs. Ibekwe (supra) struck out 3 grounds of appeal for incompetence, the appellant having alleged error in law and misdirection on each of the 3 grounds. On appeal against the order striking out the grounds, Ayoola, JSC stated as follows - 'In my opinion, what is important in a ground of appeal, and the test the court should apply, is whether or not the impugned ground shows clearly what is complained of as error in law and what is complained of as misdirection, or, as the case may be, error of fact...What makes a ground incompetent is not whether it is framed as an error and a mis-direction but whether by so stating it, the other side is left in doubt and without adequate information as to what the complaint of the appellant actually is.'"
        },
        {
            "name": "Ogbechie & Ors. v. Onochie & Ors. (1986) 2 NWLR (Pt. 23) 484",
            "tag": "Applied",
            "document_type": "Case",
            "context": "The Supreme Court pointed out in Ogbechie & Ors. vs. Onochie & Ors. (1986) 2 NWLR (Pt. 23) 484 at 491, that it is always difficult to distinguish a ground of law from a ground of fact but what is required is to examine thoroughly the grounds of appeal in the case concerned to see whether the grounds reveal a misunderstanding by the lower court of the law or a misapplication of the law to the facts already proved or admitted, in which case it would be question of law, or one that would require questioning the evaluation of facts by the lower court before the application of the law in which case it would amount to question of mixed law and facts."
        },
        {
            "name": "Debs & Anor. v. Cheico (Nig.) Ltd.",
            "tag": "Applied",
            "document_type": "Case",
            "context": "See Debs & Anor. vs. Cheico (Nig.) Ltd. (supra), wherein the Supreme Court per Oputa, JSC also added - 'The extension 'mesne profit' simply means intermediate profits - that is, profits accruing between two points of time - that is between the date when the defendant ceased to hold the premises as a tenant and the date he gives up possession. Rent is different from mesne profits. Rent is liquidated, mesne profits are not. Rent is operative during the subsistence of the tenancy, while mesne profits start to run when the tenancy expires and the tenant holds over.'"
        },
        {
            "name": "Daramola v. Att.-Gen., Ondo State (2000) FWLR (Pt. 6) 997",
            "tag": "Applied",
            "document_type": "Case",
            "context": "See Daramola vs. Att.-Gen., Ondo State (2000) FWLR (Pt. 6) 997, (2000) 7 NWLR (Pt. 665) 440. The learned Judge was clearly in error in accepting the address of learned counsel as a substitute for evidence."
        },
        {
            "name": "IBWA Ltd. v. Pavex International Co. Ltd. (2000) FWLR (Pt. 26) 1891",
            "tag": "Applied",
            "document_type": "Case",
            "context": "It is only those mistakes that have been shown to have affected or influenced the decision appealed against that will result in the appeal being allowed. See IBWA Ltd. vs. Pavex International Co. Ltd. (2000) FWLR (Pt. 26) 1891, (2000) 7 NWLR (Pt. 663) 105."
        },
        {
            "name": "Cornelius Ltd. v. Ezenwa (2002) FWLR (Pt. 117) 1207",
            "tag": "Applied",
            "document_type": "Case",
            "context": "It is a well established and settled principle of law that an appellate court will not, in principle, interfere with the discretion by the trial court unless that discretion is shown to have been exercised upon wrong principles or that the exercise was tinted by some illegality or substantial irregularity. See Cornelius Ltd. vs. Ezenwa (2002) FWLR (Pt. 117) 1207, (2003) Vol. 2 WRN 98."
        }
    ],
    "counsel_precedents": [
        {
            "name": "Nwadike v. Ibekwe (1987) 12SC 14",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Akuchie v. Nwamadi (1992) 8 NWLR (Pt. 258) 214",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Nteogwuija & Ors. v. Ikuru & Ors. (1998) 10 NWLR (Pt. 569) 267",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Ahmed Debs & Anor. v. Cheico (Nig.) Ltd. (1986) 6 SC 179",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Metal Construction (W.A.) Ltd. v. Chief Moyo Aboderin (1998) 60 LRCN 4034",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Alhaja Sabalemotu Ayinke v. Alhaji Muniru Lawal & Ors. (1994) 25A LRCN 201",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Ige v. Fagbohun (2002) FWLR (Pt. 91) 1545",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Hassan v. The Military Governor of Plateau State (2002) FWLR (Pt. 89) 1168",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Chief Kalu Igwe & 2 Ors. v. Chief Okuwa Kalu & 2 Ors. (2002) FWLR (Pt. 97) 677",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Oba Felix Abidoye & 4 Ors. v. Oba Jacob Alawode & 4 Ors. (2001) FWLR (Pt. 43) 322",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Alhaji Eniola Amusa Adeleke v. Bayo Asani & Anor. (2002) FWLR (Pt. 106) 482",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "FBN Plc v. Oniyangi (2000) 6 NWLR (Pt. 661) 497",
            "cited_by": "Court"
        },
        {
            "name": "Fasanya v. Adekoya (2001) FWLR (Pt. 34) 516",
            "cited_by": "Court"
        },
        {
            "name": "Mercantile Bank of Nig. Plc v. Nwobodo (2000) 3 NWLR (Pt. 648) 297",
            "cited_by": "Court"
        }
    ]
}