{
    "case_title": "Agboola v. Federal Republic of Nigeria",
    "area_of_law": [
        "Criminal Law",
        "Drug Law"
    ],
    "subject_matter": [
        "Drug Trafficking",
        "Unlawful Possession of Cannabis",
        "Evidence Law - Confessional Statements"
    ],
    "summary": "The appellant was charged with unlawfully transporting and trafficking 8.6 kilograms of cannabis sativa along Odo-Owa/Omu-Aran road in Kwara State. He was arrested by NDLEA officers who discovered the substance in his vehicle covered with banana leaves. The prosecution relied on his confessional statements (Exhibits A and A1) and testimony from five witnesses. The appellant claimed he was merely a commercial driver unaware of the contents and that the actual owner was released by the NDLEA. The trial court convicted him on both counts, sentencing him to 5 years and 15 years respectively. On appeal, the appellant challenged the trial court's reliance on his confessional statements and argued that the prosecution failed to prove its case beyond reasonable doubt. The Court of Appeal affirmed the conviction, holding that the confessional statements were voluntary and corroborated by other evidence.",
    "outcome": "The Court of Appeal dismissed the appeal and affirmed the trial court's conviction and sentences of 5 years and 15 years on the two counts respectively.",
    "ratios": [
        "Once a confessional statement is direct, positive and properly established, it is sufficient proof of guilt of the accused person and that alone can sustain a conviction",
        "The mere possession or trafficking of cannabis is on its own unlawful. The accused person has not shown lawful authority",
        "A free and voluntary confession which is direct and positive and properly proved is sufficient to sustain a conviction even without any corroborative evidence, so long as the court is satisfied with the truth therein",
        "It is only contradiction on material facts capable of casting doubts on the evidence adduced before the court that will lead to the acquittal of an accused person"
    ],
    "precedents": [
        {
            "name": "Bille v. State (2016) 15 NWLR (Pt. 1536) 363",
            "tag": "Cited",
            "document_type": "Case",
            "context": "It is the established position of the law, that the guilt of an accused can be proved in one or more of the following ways: Firstly, by direct or eye-witness account; secondly, by circumstantial evidence, and lastly by the confessional statement of the accused person."
        },
        {
            "name": "Baalo v. Federal Republic of Nigeria (2016) All FWLR (Pt. 858) 726",
            "tag": "Cited",
            "document_type": "Case",
            "context": "This fundamental requirement is founded upon the constitutional presumption of innocence in favour of the accused person as enshrined under section 36(5) of the Constitution of the Federal Republic of Nigeria, 1999 and the stipulations of section 138 of the Evidence Act, 2011 (as amended)."
        },
        {
            "name": "Igabele v. State (2006) All FWLR (Pt. 311) 1797",
            "tag": "Applied",
            "document_type": "Case",
            "context": "The proof demanded is proof beyond doubt, since the accused is under no obligation to prove his innocence, this entails that any slightest doubt raised by the accused person will result in the doubt being resolved in his favour."
        },
        {
            "name": "Gachi v. State (1965) 1 NMLR 333",
            "tag": "Applied",
            "document_type": "Case",
            "context": "The position of the law is that in criminal cases, the onus of proof is firmly on the prosecution. The constitutional presumption of innocence in relation to an accused person is firmly rooted in our system of criminal justice, but where the defense or any matter is within the knowledge of the accused person, the burden of leading evidence of the fact is on the accused person."
        },
        {
            "name": "Queen v. Itule (1961) All NLR 462",
            "tag": "Applied",
            "document_type": "Case",
            "context": "The law is firmly settled, in that a trial court can rely solely on the confessional statement of the accused person to convict him. A free and voluntary confession which is direct and positive and properly proved is sufficient to sustain a conviction even without any corroborative evidence, so long as the court is satisfied with the truth therein."
        },
        {
            "name": "Ehimiyein v. State (2016) 16 NWLR (Pt. 1538) 173",
            "tag": "Applied",
            "document_type": "Case",
            "context": "Moreover, in the determination of whether the statement of the appellant, exhibits A and A1, were voluntarily made, the said officer was called, and did state that he in fact duly endorsed the statements."
        }
    ],
    "counsel_precedents": [
        {
            "name": "Bature v. State (1994) 1 NWLR (Pt. 320) 267",
            "cited_by": "Counsel to Appellant",
            "context": "Relying on the case of Bature v. State (1994) 1 NWLR (Pt. 320) 267, (1994) 1 SCNJ 19, counsel submits that there is nothing outside the alleged confessional statement to suggest that it was voluntarily made."
        },
        {
            "name": "Reuben Shofoluwe v. R (1957) 13 WACA 254",
            "cited_by": "Counsel to Appellant",
            "context": "Further, relying on the case of Reuben Shofoluwe v. R (1957) 13 WACA 254 at page 265, counsel calls upon the court to expunge exhibits A and A1, being inadmissible in evidence, contending that the said documents constituted hearsay evidence."
        },
        {
            "name": "Attorney-General, Federation v. Abubakar (2007) All FWLR (Pt. 375) 405",
            "cited_by": "Counsel to Appellant",
            "context": "He further contended, that the failure of the prosecution to call the superior officer, said to have authenticated the voluntary statements amounted to injustice to the appellant, and on the authority of Attorney-General, Federation v. Abubakar (2007) All FWLR (Pt. 375) 405, (2007) 10 NWLR (Pt. 1041) 1, (2007) 4 SC (Pt. 11) 62, the court is called upon to expunge the documents."
        },
        {
            "name": "Ogbeide v. Osifo (2007) All FWLR (Pt. 365) 548",
            "cited_by": "Counsel to Respondent",
            "context": "Relying on the case of Ogbeide v. Osifo (2007) All FWLR (Pt. 365) 548 at page 553, (2007) 3 NWLR (Pt. 1022) 423, learned counsel opined that once a document is relevant and having been admitted in evidence, the court is bound to act or rely on it in determining the case against the accused person."
        },
        {
            "name": "Are v. Ipaye (1986) 3 NWLR (Pt. 29) 416",
            "cited_by": "Court",
            "context": "See Are v. Ipaye (1986) 3 NWLR (Pt. 29) 416; Chukwuogor v. Obuora (1987) 3 NWLR (Pt. 61) 454, (1987) 2 NSCC 1063."
        },
        {
            "name": "Esekhaigbe v. FRSC (2015) 12 NWLR (Pt. 1474) 520",
            "cited_by": "Court",
            "context": "No doubt, a respondent has the right to formulate issues from the grounds of appeal in the appellant's notice of appeal, as they presently did, see Esekhaigbe v. FRSC (2015) 12 NWLR (Pt. 1474) 520"
        },
        {
            "name": "Emeka v. State (2014) 13 NWLR (Pt. 1425) 614",
            "cited_by": "Court",
            "context": "See Emeka v. State (2014) 13 NWLR (Pt. 1425) 614; Agbareh v. Mimra (2008) All FWLR (Pt. 409) 559, (2008) 2 NWLR (Pt. 1071) 378."
        },
        {
            "name": "Olanipekun v. State (2016) All FWLR (Pt. 845) 123",
            "cited_by": "Court",
            "context": "The courts however, dutifully test the truth of a confession by examining it in the light of the other credible evidence before the court. See Queen v. Itule (1961) All NLR 462, (1961) 2 NSCC 183, (1961) 2 SCNLR 183; Olanipekun v. State (2016) All FWLR (Pt. 845) 123, (2016) 13 NWLR (Pt. 1528) 100 at page 125"
        },
        {
            "name": "Nwangbomu v. State (1994) 2 NWLR (Pt. 327) 380",
            "cited_by": "Court",
            "context": "See Nwangbomu v. State (1994) 2 NWLR (Pt. 327) 380, (1994) 2 SCNJ 107; Bature v. State (1994) 1 NWLR (Pt. 320) 267, (1994) 1 SCNJ 19."
        },
        {
            "name": "Oroke v. Ede (1964) NNLR 118",
            "cited_by": "Court",
            "context": "The judicial role of an appellate court is to superintend, review and correct any errors made by the trial court. To see whether the trial court applied the applicable law or adhered to the proper procedure in arriving at its decision. See Oroke v. Ede (1964) NNLR 118"
        }
    ]
}