{
    "case_title": "Akahall & sons limited v. N.D.I.C.",
    "area_of_law": [
        "Company law",
        "Civil procedure",
        "Banking law"
    ],
    "subject_matter": [
        "Undefended list procedure",
        "Court jurisdiction",
        "Liquidation proceedings",
        "Debt recovery"
    ],
    "summary": "The appellant initiated an action against the respondent (NDIC) as receiver/liquidator of Allied Bank of Nigeria Plc under the undefended list procedure to recover monies owed. After initial proceedings and an appeal that ordered a retrial, the case was transferred to the Uyo Division of the Federal High Court. When the respondent failed to appear or file a notice of intention to defend, judgment was entered against them. The respondent then sought to set aside the judgment, arguing that certain conditions precedent under various Acts had not been met. The trial court set aside the judgment and transferred the matter to the general cause list. The Court of Appeal affirmed this decision. On further appeal to the Supreme Court, it was held that the trial court was wrong to set aside its judgment under the undefended list as it had become functus officio. The Supreme Court restored the original judgment in favor of the appellant.",
    "outcome": "The Supreme Court allowed the appeal, set aside the Court of Appeal's order that affirmed setting aside the judgment, and restored the original judgment entered in favor of the plaintiff on the undefended list.",
    "ratios": [
        "A judgment entered in favour of the plaintiff on the undefended list is a judgment on the merit and can be overturned only on appeal",
        "The failure to file or deliver a notice of intention to defend as provided by the rules is tantamount to an admission by the defendant of the plaintiff's claim",
        "Where a court makes a mistake of law in its decision, that mistake can be corrected only through appeal except where the judgment is given without jurisdiction"
    ],
    "precedents": [
        {
            "name": "Mobil Producing (Nig.) Unlimited v. L.A.S.E.P.A. (2002) 18 NWLR (Pt. 798) 1",
            "tag": "Applied",
            "document_type": "Case",
            "context": "Much stress has been placed on the argument that non-compliance with provisions such as section 29(2) of the Act (Federal Environmental Protection Agency Act) leads to a question of jurisdiction which can be raised at any time and which if resolved against the appellant, renders the entire proceedings a nullity. This rather mechanical approach to the issue which tends to ignore the distinction between jurisdictional incompetence which is evident on the face of the proceedings and one which is dependent on ascertainment of facts, leads to error ... When the competence of the court is alleged to be affected by procedural defect in the commencement of the proceedings and the defect is not evident but is dependent on ascertainment of facts, the incompetence cannot be said to arise on the face of the proceedings."
        },
        {
            "name": "Intercontinental Bank Ltd v. Brifina Ltd (2012) 13 NWLR (Pt. 1316) 1",
            "tag": "Cited",
            "document_type": "Case",
            "context": "... when one considers the issue of receivership raised in the conditional memorandum of appearance, one will really see that a triable issue is manifested therein, and in the circumstances, the suit should have been transferred to the general cause list by virtue of Order 24, rule 9(5) of the High Court of Anambra State (Civil Procedure) Rules, 1988"
        },
        {
            "name": "First Bank (Nig.) Ltd v. Khaladu (1993) 9 NWLR (Pt. 315) 44",
            "tag": "Applied",
            "document_type": "Case",
            "context": "It was explained in First Bank (Nig.) Ltd v. Khaladu at page 55 that the failure to deliver a notice of intention to defend means only one thing that is, that the defendant has no defence to the plaintiff's claim. Therefore failure to file or deliver a notice of intention to defend as provided by the rules is tantamount to an admission by the defendant of the plaintiff's claim and it is settled law that facts admitted need no proof."
        },
        {
            "name": "Macaulay v. NAL Merchant Bank Ltd (1986) 5 NWLR (Pt. 40) 216",
            "tag": "Applied",
            "document_type": "Case",
            "context": "A defendant who has no real defence to the action should not be allowed to dribble and frustrate the plaintiff and cheat him out of the judgement he is legitimately entitled to by delay tactics aimed not at offering any real defence to the action but at giving time within which he may continue to postpone meeting his obligation and indebtedness to the plaintiff. It is most inexpedient to allow a defendant who has no real defence to its action to defend for mere purpose of delay"
        },
        {
            "name": "Mark v. Eke (2004) 5 NWLR (Pt. 865) 54",
            "tag": "Applied",
            "document_type": "Case",
            "context": "Furthermore where a court makes a mistake of law in its decision, that mistake can be corrected only through appeal except where the judgement is given without jurisdiction"
        },
        {
            "name": "U.A.C. (Technical) Ltd v. Anglo Canadian Cement Ltd (1996) NMLR 349",
            "tag": "Cited",
            "document_type": "Case",
            "context": "As such, the trial court cannot set it aside"
        },
        {
            "name": "Bank of the North Ltd v. Intra Bank S.A. (1969) 1 All NLR 91",
            "tag": "Cited",
            "document_type": "Case",
            "context": "As such, the trial court cannot set it aside"
        },
        {
            "name": "U.T.C. Nig. Ltd v. Pamotei (1989) 2 NWLR (Pt. 103) 244",
            "tag": "Cited",
            "document_type": "Case",
            "context": "The only alternative method of tampering with such a judgment on the merits would be by yet another action in the case of allegation of fraud"
        },
        {
            "name": "Wema Securities and Finance Plc v. NAIC (2015) LPELR-24833 (SC)",
            "tag": "Cited",
            "document_type": "Case",
            "context": "the undefended list procedure is a truncated form of the civil litigation process peculiar to the adversarial judicial system. Under the said procedure, ordinary hearing is rendered unnecessary due, in the main, to the absence of an issue to be tried"
        }
    ],
    "counsel_precedents": [
        {
            "name": "Umunna v. Okwuraiwe (1978) 6-7 SC 1",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Obioha v. Ibero (1994) 1 NWLR (Pt. 322) 503",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Ben Thomas Hotels Ltd v. Sebi Furniture Co. Ltd (1989) 5 NWLR (Pt. 123) 523",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "In re: Mbamalu (2002) FWLR (Pt. 85) 246",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "United Bank for Africa Plc & Anor. v. Jargaba (2007) All FWLR (Pt. 380) 1419",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Agwuneme v. Eze (1990) 3 NWLR (Pt. 137) 242",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "International Bank for West Africa Limited v. Unakalamba (1998) 9 NWLR (Pt. 656) 245",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Cooperative and Commerce Bank (Nigeria) Plc v. Samed Investment Company Limited (2000) 4 NWLR (Pt. 651) 19",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Bendel Construction Co. Ltd v. Anglo Development Co. (Nigeria) Ltd (1972) All NLR (Pt. 1) 153",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Olubusola Stores v. Standard Bank (Nig.) Ltd (1975) 1 All NLR (Pt. 1) 125",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Nkwo Market Community Bank (Nig.) Ltd v. Obi (2010) All FWLR (Pt. 529) 1094",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Ataguba & Co. v. Gura (Nig.) Ltd (2005) All FWLR (Pt. 256) 1219",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Macaulay v. NAL Merchant Bank Ltd (1990) 4 NWLR (Pt. 144) 283",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Nwankwo & Anor. v. Ecumenical Development Cooperative Society UA (2007) All FWLR (Pt. 360) 1448",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Cow v. Casey (1949) 1 K.B. 482",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Sodipo v. Lemminkainen OY (No. 2) & Ors. (1986) 1 NWLR (Pt. 15) 220",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Obaro v. Hassan (2013) LPELR-20089 (SC)",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Planwell Ltd v. Ogala (2003) 18 NWLR (Pt. 852) 478",
            "cited_by": "Referenced in Judgment"
        },
        {
            "name": "Adebisi Macgregor Ass. Ltd v. N.M.B. Ltd (1996) 2 NWLR (Pt. 43) 378",
            "cited_by": "Referenced in Judgment"
        }
    ]
}