{
    "case_title": "Akunwata Onyeachonam Okolonji v. Chief A.C.I. Mbanefo & Anor",
    "area_of_law": [
        "Customary Law",
        "Traditional Institutions Law"
    ],
    "subject_matter": [
        "Traditional Title Dispute",
        "Chieftaincy Rights",
        "Interlocutory Injunction"
    ],
    "summary": "This case involves a dispute over the traditional title of Odu Osodi of Onitsha. Chief A.C.I. Mbanefo claimed he was duly installed as Odu Osodi of Onitsha in 1994 and was entitled to occupy the traditional office and hold the traditional rank of Ndichieume and Ndichie Ukpo for life according to Onitsha Native Law and Custom. He sought declaratory reliefs and perpetual injunction against Igwe N.A.U. Achebe and Akunwata Onyeachonam Okolonji, claiming that the purported installation of Okolonji as Odu Osodi during Mbanefo's lifetime was illegal and void. The case centered on an appeal against an interlocutory injunction granted by the trial court in favor of Chief Mbanefo.",
    "outcome": "The Court of Appeal dismissed the appeal and upheld the interlocutory injunction granted by the trial court, awarding costs of N50,000 to the first respondent.",
    "ratios": [
        "The status quo to be kept or maintained pending trial would be dependent on the nature of the subject matter in dispute coupled with the kind of injury that if an interlocutory injunction is not granted may result to the detriment of the party that applied for the remedy by the time the rights of the parties were determined at the end of the trial.",
        "No citizen is to take laws into their hands. Courts of Justice do not encourage self-help. Grievances should be submitted to the Courts of law and equity for determination.",
        "The power the Court of Appeal may exercise upon the hearing of an appeal is circumscribed by the requirements of the provisions of Order 4 Rules 9(1)-(5) of the Court of Appeal Rules, 2011"
    ],
    "precedents": [
        {
            "name": "Automatic Telephone And Electric Co. Ltd. vs. The Federal Military Government of the Federal Republic of Nigeria (1968) All NLR 416",
            "tag": "Cited",
            "document_type": "Case",
            "context": "We observe that decisions or judgments are called opinions in the United States and we cannot see the difference between these words in the present context. For these reasons we hold the view that the decision of the learned Chief Justice on the particular question before him was a final decision and that an appeal would lie."
        },
        {
            "name": "Ojora & Ors. vs. Odunsi (1964) NMLR 12",
            "tag": "Cited",
            "document_type": "Case",
            "context": "It is within the discretion of this Court to grant an application for extension of time to appeal if the circumstances of the case warrant it. In the particular case on appeal before us the would-be-appellants are out of time because of an error in Law in treating the order sought to be appealed against as a final instead of an interlocutory one, a matter which is not always free from difficulties"
        },
        {
            "name": "Julius Berger (Nig) Ltd vs. Femi (1993) 5 NWLR (Pt.295) 612",
            "tag": "Applied",
            "document_type": "Case",
            "context": "This Court is bound by the entries made by the learned trial Judge in regard to the proceedings of 20th March, 2006."
        },
        {
            "name": "N.P.M. Co. Ltd. vs. CNDETS. S. (1971) 1 NMLR 223",
            "tag": "Cited",
            "document_type": "Case",
            "context": "This Court will act only on the printed and certified true copies of the record of appeal."
        },
        {
            "name": "Enekebe vs. Enekebe (1964) NMLR 42",
            "tag": "Applied",
            "document_type": "Case",
            "context": "In the cases on discretion which I have seen, the trial Court goes by the material presented to it, and the Court of Appeal goes by the material in the record"
        },
        {
            "name": "Gonzee (Nig.) Ltd vs. NERDC (2005) All FWLR (Pt.274) 235",
            "tag": "Applied",
            "document_type": "Case",
            "context": "The Court and the parties are bound by the record of appeal as certified and is presumed correct unless the contrary is proved. A party who challenges the correctness of record of proceedings must swear to an affidavit setting out the facts or a part of the proceeding omitted or wrongly stated in the record. Such affidavit must be served on the Judge or registry of the Court concerned"
        },
        {
            "name": "The Military Governor of Lagos State & Ors. vs. Chief Ojukwu & Ors. (1986) All NLR 233",
            "tag": "Applied",
            "document_type": "Case",
            "context": "Admittedly, the country is now governed by military regime but it is to the external credit of all the military governments in Nigeria in general and the present military regime in particular, that each pledged itself to observe and to be bound by the basic principles of the rule of law. This is highly commendable for where the rule of law is forced to abdicate the rule of force is automatically enthroned."
        }
    ],
    "counsel_precedents": [
        {
            "name": "Panalpina vs. Glenyork (2002) 8 WRN 114",
            "cited_by": "Court's reference"
        },
        {
            "name": "Elesie Agba vs. Okogbue (1991) 7 NWLR (Pt.204) 391",
            "cited_by": "Counsel for 2nd defendant (J.H.C. Okolo, SAN)"
        },
        {
            "name": "Bulunkutu vs. Zwangina (1997) 11 NWLR (Pt.529) 526",
            "cited_by": "Counsel for 2nd defendant (J.H.C. Okolo, SAN)"
        },
        {
            "name": "Akinwose vs. AIT Ltd. (1961) WRNLR 116",
            "cited_by": "Counsel for 2nd defendant (J.H.C. Okolo, SAN)"
        },
        {
            "name": "NAL Bank (2002)",
            "cited_by": "Dr. J.O. Ibik, SAN (Counsel for plaintiff)"
        },
        {
            "name": "Governor of Lagos State, Onyeso & Nebedom",
            "cited_by": "Dr. J.O. Ibik, SAN (Counsel for plaintiff)"
        },
        {
            "name": "Akibu vs. Oduntan",
            "cited_by": "Dr. J.O. Ibik, SAN (Counsel for plaintiff)"
        },
        {
            "name": "Adanji vs. Hunvoo (1908) 1 NLR 74",
            "cited_by": "Court's reference"
        },
        {
            "name": "Cowley vs. Cowley (1901) A.C. 450",
            "cited_by": "Court's reference"
        },
        {
            "name": "Ademola vs. Thomas (1946) 12 WACA 81",
            "cited_by": "Court's reference"
        },
        {
            "name": "Onitolo vs. Bello",
            "cited_by": "Court's reference"
        },
        {
            "name": "Akano vs. Ajuwon",
            "cited_by": "Court's reference to Supreme Court judgment"
        }
    ]
}