{
    "case_title": "Alhaji Kamoru Agbaje and others v. Miss Adesola Otunla and another",
    "area_of_law": [
        "Property Law",
        "Inheritance Law",
        "Civil Procedure"
    ],
    "subject_matter": [
        "Locus Standi",
        "Land Inheritance",
        "Estate Administration"
    ],
    "summary": "This case involves an appeal against a ruling of the Oyo State High Court concerning the locus standi of the Respondents (children of late Chief L.A. Otunla) to challenge land sales. The Respondents claimed that certain parcels of their late father's land were illegally sold without proper authority. The Appellants (6th-13th Defendants) challenged the Respondents' locus standi, arguing that their land parcels were not part of Chief Otunla's estate as mentioned in his will. The trial court dismissed the challenge to locus standi, holding that the issue of land identity was a matter of evidence to be determined at trial, not a basis for denying standing. The Court of Appeal upheld the trial court's decision, confirming that the Respondents, as children claiming inheritance rights, had sufficient interest to maintain the action.",
    "outcome": "The appeal was dismissed. The Court of Appeal affirmed the trial court's ruling that the Respondents had the requisite locus standi to institute the action. Costs of N30,000 were awarded against the Appellants.",
    "ratios": [
        "In determining locus standi, the Plaintiff's Statement of Claim should be the only process that should receive the attention of the Court. It is the cynosure of the exercise.",
        "The defendant who challenges locus standi is deemed to have accepted as true the averments in the Plaintiff's Statement of Claim.",
        "When a Court is called upon to determine whether a Plaintiff has locus standi or not, it must confine itself to the Writ of Summons and the Statement of Claim before it and no more, as the issue of locus standi is a matter of law.",
        "Locus standi connotes the legal capacity of a person to institute legal action in a Court of law. For a person to approach the Court, he must be able to show that his civil rights and obligations have been or are in danger of being violated or infringed upon."
    ],
    "precedents": [
        {
            "name": "Olaniyan v. Adeniyi (2007) All FWLR (pt. 387) p. 916",
            "tag": "Applied",
            "document_type": "Case",
            "context": "Locus Standi is usually deduced or determined from all the facts averred in the Statement of Claim. The Court's approach is to look at the Statement of Claim to ascertain whether the Plaintiff's sufficient interest has been disclosed and how the said interest has arisen from the subject matter of litigation. Where, in the course of scrutinizing the Statement of Claim, the averments disclose the interest of the Plaintiff and the interest is threatened with violation or actually violated by the Defendant, the Plaintiff would be adjudged by the Court to have clearly shown sufficient interest to entitle him to sue on the subject matter."
        },
        {
            "name": "Disu v. Ajilowura (2006) 14 NWLR (pt. 1000) p. 783",
            "tag": "Applied",
            "document_type": "Case",
            "context": "This Court has consistently held that in the determination of locus standi, the Plaintiff's Statement of Claim should be the only process that should receive the attention of the Court. It is the cynosure of the exercise. I will take only two cases. In Adesokun v. Prince Adegorolu (1997) 3 NWLR (pt. 493) p. 261, this Court held that in order to determine whether a Plaintiff has locus standi or not, it is the Statement of Claim that one looks at. It is a well-established principle of law that a Defendant who challenges in limine the locus standi of the Plaintiff is deemed to accept as correct all the averments contained in the Plaintiff's Statement of Claim."
        },
        {
            "name": "Owoduni v. Registered Trustees of Celestial Church of Christ (2000) 6 S.C. (pt.II) 60",
            "tag": "Applied",
            "document_type": "Case",
            "context": "The question whether or not a Plaintiff has locus standi in a suit is determined from a totality of all the averments in his Statement of Claim. Thus, in dealing with the locus standi, of a Plaintiff, it is his Statement of Claim alone that has to be carefully scrutinized with a view to ascertaining whether or not it has disclosed his interest and how such interest has arisen in the subject matter of the action."
        }
    ],
    "counsel_precedents": [
        {
            "name": "Oduwole v. Famakinwa (1990) NWLR (pt. 143) p. 239",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Ajadi v. Okenihun (1985) 1 All NLR (pt. 1) p. 213",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Ajao v. Sonola (1973) 1 N.M.L.R p. 355",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Tetas Petroleum Co. & Ors v. Texaco Nigeria Plc & Ors (2008) 1 FWLR (pt. 411) p. 1003",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Disu v. Ajilowura (2006) 14 NWLR (pt. 1000) p. 783",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "A.G. Kaduna State v. Hassan (1985) 2 NELR (pt. 8) p. 483",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Ladejobi v. Oguntayo (2004) 18 NWLR (pt. 904) p. 149",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Unity Bank Plc v. Bouari (2008) 7 NWLR (pt. 1086) p. 372",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "U.B.A Plc v. B.T.L Industrial Ltd (2004) 18 NWLR (pt. 904) p. 180",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Duhu v. Oladejo (2004) 17 NWLR (pt. 903) p. 621",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "E.T & E.C. (Nig.) Ltd v. Nevico Ltd (2004) 3 NWLR (pt. 806) p. 327",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Babayeju v. Ashamu (1998) 9 NWLR (pt. 567) p. 546",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Ugwu v. Agbo (1977) 10 S.C. p.27",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Melifonwu v. Egbiyi (1982) 9 S.C. p. 145",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Chief M.O.A. Agbaisi & Ors v. Ebikorefe (1997) 4 NWLR (pt. 502) p. 630",
            "cited_by": "Counsel to Respondent"
        },
        {
            "name": "Aina v. Obabiolorunkosi (1986) 2 NWLR (pt. 22) p. 316",
            "cited_by": "Counsel to Respondent"
        }
    ]
}