{
    "case_title": "Ani v. Effiok",
    "area_of_law": [
        "Constitutional Law",
        "Civil Procedure"
    ],
    "subject_matter": [
        "Right of Appeal",
        "Leave to Appeal",
        "Extension of Time",
        "Grounds of Appeal"
    ],
    "summary": "This case concerns an application for extension of time to seek leave to appeal against a Court of Appeal judgment delivered on July 4, 2013. The applicants had initially filed a notice of appeal containing grounds of mixed law and facts without first obtaining leave as required by law. Upon realizing this error, they filed a fresh application seeking extension of time to seek leave to appeal, leave to appeal, and extension of time to file notice of appeal. The respondents opposed the application through preliminary objections, arguing that the court lacked jurisdiction due to the incompetent initial notice of appeal. The Supreme Court held that while the initial notice of appeal was indeed incompetent, the applicants were not precluded from filing a fresh application to regularize their position, as the right of appeal is constitutional and should not be denied on technical grounds.",
    "outcome": "The Supreme Court granted the application for extension of time to seek leave to appeal, leave to appeal, extension of time to file notice and grounds of appeal, and leave to appeal on grounds of mixed law and facts. The court gave the applicants 21 days to file their notice and grounds of appeal.",
    "ratios": [
        "A notice of appeal is the spinal cord of an appeal. It is the foundation upon which an appeal is based. Where the notice of appeal is defective, no proper appeal can stand.",
        "An incompetent notice of appeal deprives a court of jurisdiction to hear the appeal.",
        "The right of appeal, being constitutional, stands to override most other negative principles aimed at its foreclosing.",
        "Where leave of court is required and the time within which to appeal has also expired, the appellant may apply for extension of time to seek leave to appeal.",
        "The fact that an appellant had filed an incompetent notice of appeal does not preclude him from applying to an appellate court for an extension of time within which to file the notice of appeal."
    ],
    "precedents": [
        {
            "name": "Aderibigbe v. Abidoye",
            "tag": "Applied",
            "document_type": "Case",
            "context": "See Aderibigbe v. Abidoye (2009) 10 NWLR (Pt. 1150) 553, (2009) 4 - 5 SC (Pt. 3) 123, where Muhammad JSC, explained: 'A notice of appeal is the spinal cord of an appeal. It is the foundation upon which an appeal is based. It is the originating process, which sets the ball rolling for the proper, valid and lawful commencement of an appeal. Where the notice of appeal is defective, no proper appeal can stand. It will, certainly, collapse. A notice of appeal can be competent and valid if it contains at least one valid ground of appeal. A bare notice of appeal without any ground or grounds of appeal, is valueless and incompetent. It is incurably bad. The defect cannot be cured by amendment'."
        },
        {
            "name": "Odofin v. Agu",
            "tag": "Applied",
            "document_type": "Case",
            "context": "For there to be a valid appeal, the three reliefs must be granted by the court - see Odofin v. Agu (1992) 3 NWLR (Pt. 229) 350, (1992) 3 SCNJ 161, wherein this court held: 'The appellant made his application as prescribed by the rules, but omitted a relevant prayer. That is the prayer extending time to give notice of appeal. This notice is crucial and decisive because the judgment appealed against was decided on 16 May 1985...In the absence of a notice of appeal, namely, the foundation of the appeal, there is no appeal before the court.'"
        },
        {
            "name": "Nalsa Team Associates v. N.N.P.C",
            "tag": "Followed",
            "document_type": "Case",
            "context": "In Nalsa Team Associates v. N.N.P.C's case (supra), this court held: 'Where there is before the court a proper application to correct the error even if it could have the effect of breathing life into an incompetent appeal, I see nothing wrong with the court taking such an application first.'"
        },
        {
            "name": "Anachebe v. Ijeoma",
            "tag": "Applied",
            "document_type": "Case",
            "context": "See Anachebe v. Ijeoma (2014) 14 NWLR (Pt. 1426) 183, (2015) All FWLR (Pt. 784) 183, cited by the appellants, where Ogunbiyi JSC, aptly observed: 'It is well settled that a right of appeal is constitutional as is provided in the Constitution. The right being constitutional therefore, it stands to override most other negative principles aimed at its foreclosing.'"
        },
        {
            "name": "Nwora v. Nwabueze",
            "tag": "Cited",
            "document_type": "Case",
            "context": "If one is missing, the application must fail See Nwora v. Nwabueze (2011) 15 NWLR (Pt. 1271) 467 SC."
        },
        {
            "name": "Ogbechie & Ors. v. Onochie & Ors.",
            "tag": "Cited",
            "document_type": "Case",
            "context": "See Ogbechie & Ors. v. Onochie & Ors. (No. 1) (1986) 2 NWLR (Pt. 23) 484, (1986) 3 SC 54"
        },
        {
            "name": "Odoemena Nwaigwe & Ors. v. Eze Edwin Okere",
            "tag": "Applied",
            "document_type": "Case",
            "context": "In Odoemena Nwaigwe & Ors. v. Eze Edwin Okere (2008) All FWLR (Pt. 431) 843, (2008) 13 NWLR (Pt. 1105) 445 at 474, paragraphs C-F, which was cited and relied by learned counsel for the 2nd set of respondents this court per Onnoghen JSC (as he then was) held: 'The issue of the filing of six additional grounds of appeal is a non-starter as it amounts to an exercise in futility, there being no valid notice of appeal due to the absence of valid ground of appeal raising question of customary law for determination.'"
        }
    ],
    "counsel_precedents": [
        {
            "name": "Central Bank of Nigeria v. Ahmed",
            "cited_by": "Counsel to 1st Set of Respondents"
        },
        {
            "name": "Ubaka & Sons Ltd v. Ezekween & Co.",
            "cited_by": "Counsel to 1st Set of Respondents"
        },
        {
            "name": "Arubo v. Aiyeleru",
            "cited_by": "Counsel to 1st Set of Respondents"
        },
        {
            "name": "National Inland Waterways Authority v. Shell Petroleum Development Company of Nigeria",
            "cited_by": "Counsel to 1st Set of Respondents"
        },
        {
            "name": "Efetioroje v. Okpalefe",
            "cited_by": "Counsel to 1st Set of Respondents"
        },
        {
            "name": "Nwokedi v. R.T.A. Limited",
            "cited_by": "Counsel to 1st Set of Respondents"
        },
        {
            "name": "Olumesan v. Ogundepo",
            "cited_by": "Counsel to 1st Set of Respondents"
        },
        {
            "name": "Ekudan v. Keregbe",
            "cited_by": "Counsel to 1st Set of Respondents"
        },
        {
            "name": "Ugesi v. Siki",
            "cited_by": "Counsel to 2nd Set of Respondents"
        },
        {
            "name": "Ogoejeofo v. Ogoejeofo",
            "cited_by": "Counsel to 2nd Set of Respondents"
        },
        {
            "name": "Abubakar v. Bebeji Oil and Allied Products Limited",
            "cited_by": "Counsel to 2nd Set of Respondents"
        },
        {
            "name": "First Bank of Nigeria Plc v. T.S.A. Industries Ltd",
            "cited_by": "Counsel to Applicants"
        },
        {
            "name": "Olanrewaju v. Bon Ltd",
            "cited_by": "Counsel to Applicants"
        }
    ]
}