{
    "case_title": "Orisakwe v state",
    "area_of_law": [
        "Criminal Law"
    ],
    "subject_matter": [
        "Murder",
        "Criminal Responsibility",
        "Age of Criminal Responsibility",
        "Death Sentence"
    ],
    "summary": "The appellant was charged with murder of Sylvanus Agbarakwe contrary to section 319(1) of the Criminal Code. The prosecution's case stated that on September 20, 1993, during a mourning clothes removal ceremony, the appellant stabbed the deceased with a dagger after a confrontation. The appellant claimed he was 14 years old at the time and struck the deceased with a stone in self-defense. His father presented a birth certificate which was later proven to be forged. The trial court conducted additional proceedings to determine the appellant's true age, found him to be over 18 at the time of the offense, convicted him of murder, and sentenced him to death. The Court of Appeal upheld the conviction, and the Supreme Court dismissed the subsequent appeal.",
    "outcome": "The Supreme Court dismissed the appeal and affirmed the decisions of both the Court of Appeal and the trial court, upholding the appellant's conviction for murder and death sentence.",
    "ratios": [
        "The age of the accused was immaterial whether with regard to criminal responsibility or sentence since he was proven to be over 17 years old at the time of the offense.",
        "It is dangerous for a trial Judge to allow himself to be influenced by any extraneous event which takes place outside his court, because such could lead to a miscarriage of justice.",
        "The calling of additional witnesses suo motu by the trial Judge though irregular, did not occasion miscarriage of justice when counsel had the opportunity to cross-examine the witnesses.",
        "An intent to kill can be inferred from the nature of the wound inflicted on the deceased."
    ],
    "precedents": [
        {
            "name": "Onuoha v. The State (1989) 2 NWLR (Pt. 101) 23",
            "tag": "Applied",
            "document_type": "Case",
            "context": "The other issue I would like to consider is the regularity or otherwise of the calling of two witnesses suo motu by the trial Judge after the close of the defence. In Police v. Horvat (1952) 20 NLR 52, applying R. v. Owen (1952) 1 All ER 1040, it was held that it would be contrary to natural law and against the spirit of the law for a trial court to recall an accused person (or call a witness for that matter) after the close of defence and addresses in order to clear up its doubts. For that would in effect be depriving the accused of the benefit of the doubt."
        },
        {
            "name": "West v. Police (1952) 20 NLR 71",
            "tag": "Cited",
            "document_type": "Case",
            "context": "See West v. Police (1952) 20 WACA 71 and R v. Egwuatu (1940) 6 WACA 79 and Ejukolem v. Police (1952) 14 WACA 161"
        },
        {
            "name": "R v. Egwuatu (1940) 6 WACA 79",
            "tag": "Cited",
            "document_type": "Case",
            "context": "See West v. Police (1952) 20 WACA 71 and R v. Egwuatu (1940) 6 WACA 79 and Ejukolem v. Police (1952) 14 WACA 161"
        },
        {
            "name": "Ejukolem v. Police (1952) 14 WACA 161",
            "tag": "Cited",
            "document_type": "Case",
            "context": "See West v. Police (1952) 20 WACA 71 and R v. Egwuatu (1940) 6 WACA 79 and Ejukolem v. Police (1952) 14 WACA 161"
        },
        {
            "name": "R. v. Dora Harris (1928) 20 Cr. App. R. 86",
            "tag": "Applied",
            "document_type": "Case",
            "context": "After the close of the case for the defence, the trial Judge can call a witness proprio motu or suo motu if, and only if, the defence has set up a case ex improviso, which no human ingenuity can foresee. But even here it should be made quite clear that the 'evidence is not such as is only calculated to do an injustice to the accused but one essential to a just decision of the case'"
        },
        {
            "name": "Queen v. Moses Onoro (1961) 1 All NLR (Pt.1) 33",
            "tag": "Applied",
            "document_type": "Case",
            "context": "As submitted by the prosecution, the law is settled that an intent to kill can be inferred from the nature of the wound inflicted on the deceased. See Queen v. Moses Onoro (1961) 1 All NLR (Pt.1) 33; Ejelikwu v. State (1993) 7 NWLR (Pt.307) 554 SC."
        },
        {
            "name": "Mbenu v. State (1988) 3 NWLR (Pt.84) 615",
            "tag": "Applied",
            "document_type": "Case",
            "context": "A tainted witness is a witness who, though not an accomplice, is a witness who may have a purpose of his own or her to serve ... the evidence of such witness should be treated with a toothcomb ... trial courts have been advised to be wary in convicting on the evidence of such witnesses without some corroboration"
        },
        {
            "name": "Isiyaku Mohammed v. Kano Native Authority (1968) 1 All NLR 424",
            "tag": "Applied",
            "document_type": "Case",
            "context": "It has been suggested that a fair hearing does not mean a fair trial. We think a fair hearing must involve a fair trial and a fair trial of a case consists of the whole hearing. We therefore see no difference between the two. The true test of a fair hearing ... is the impression a reasonable person who was present at the trial whether from his observation, justice has been done in the case."
        },
        {
            "name": "Rasaki Ariori & Ors. v. Muraino B. Elemo & Ors. (1983) 1 SC 13",
            "tag": "Cited",
            "document_type": "Case",
            "context": "See also Rasaki Ariori & Ors. v. Muraino B. Elemo & Ors. (1983) 1 SC 13 at 20, 26 and 59, (1983) 1 SCNLR 1."
        }
    ],
    "counsel_precedents": [
        {
            "name": "Okpulor v. The State (1990) 7 NWLR (Pt.164) 581",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "UBA Ltd. v. Achortt (1990) 6 NWLR (Pt. 156) 254",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Theophilus v. The State (1996) 1 NWLR (Pt.423) 139",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Okeke v. A. Obidife & Ors. (1965) 1 All NLR 50",
            "cited_by": "Counsel to Appellant"
        },
        {
            "name": "Ilodibia v. NCC Ltd. (1997) 7 NWLR (Pt. 502) 174",
            "cited_by": "Counsel to Respondent"
        }
    ]
}